Revit 2027 API
ParameterTypeId.PathReinHookOrient1Wall Property
 "Primary Bar - Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinHookOrient1Wall { get; }
Public Shared ReadOnly Property PathReinHookOrient1Wall As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinHookOrient1Wall {
	ForgeTypeId^ get ();
}
static member PathReinHookOrient1Wall : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace